<template>
  <div>
    <div>
      <v-row>
        <v-col cols="4">
          <v-btn
            class="ma-2"
            outlined
            color="indigo"
          >
            Clinic Report
          </v-btn>
        </v-col>
        <v-col cols="4">
          <v-btn
            class="ma-2"
            outlined
            color="indigo"
          >
            TB-Report
          </v-btn>
        </v-col>
        <v-col cols="4">
          <v-btn
            class="ma-2"
            outlined
            color="indigo"
          >
            HTS
          </v-btn>
        </v-col>
        <v-col cols="4">
          <v-btn
            class="ma-2"
            outlined
            color="indigo"
          >
            Skin
          </v-btn>
        </v-col>
      </v-row>
    </div>
  </div>
</template>

<script>
  export default {
    data () {
      return {
        panel: [0, 2],
        projects: [
          { title: 'Online Consultation', due: '2020-Jan-1', status: 'completed', person: 'AZ', text: 'ယခုလို အသွားအလာ ခက်ခဲသောကာလတွင် လူနာများ ဆရာ၀န်များနှင့် တိုင်ပင်ဆွေးနွေး အကြံဉာဏ်ယူပြီး ဆေးကုသမှုများ လုပ်ဆောင်နိုင်ရန်အတွက် ပစ်တိုင်းထောင်ဆေးခန်းမှ အစီအစဉ်တစ်ခုကို မိတ်ဆက်ပေးချင်ပါသည်။ ၎င်းအစီအစဉ်တွင် ၁. လူနာ (သို့ )လူနာရှင်က ဆေးခန်းကို ဆက်သွယ် စာရင်းသွင်းခြင်း၂. ဆေးခန်းက ဆိုင်ရာဆရာ၀န်နှင့် တွေ့ဆုံမှုကို online မှ တဆင့် ပြုလုပ်နိုင်ရန် စီစဉ်ပေးခြင်း၃. လူနာနှင့် ဆရာ၀န်တို့ online မှ Video Chatting တွေ့ဆုံဆွေးနွေးခြင်း၄. ဆရာ၀န်ညွှန်ကြားသော ဆေးကုသမှုနှင့် ဆေးများကို ဆေးခန်းတွင် လာရောက်ထုတ်ယူခြင်းတို့ ပါ၀င်ပါမည်။၁. ဆေးခန်းကို ဆက်သွယ်စာရင်းသွင်းခြင်း(က) ယခင် အချိန်များအတိုင်း ဖုန်းဆက်၍ စာရင်းသွင်းနိုင်ပါသည်။☎ 095215612, 09-788798299 နံပါတ်များသို့ ( လူနာအမည်၊ အသက်၊ ပြသလိုသော ဆရာ၀န်၊ ပြသလိုသော အကြောင်းအရာတို့ကို ပြည့်စုံအောင် ပြောဆိုခြင်း (သို့) message ပေးပို့ခြင်းတို့ဖြင့် ဆောင်ရွက်နိုင်ပါသည်။(ခ) ယခုဖတ်ရှုနေသော ပစ်တိုင်းထောင် page ၏ message (messanger) မှတဆင့်လည်း အထက်ပါလိုအပ်ချက်များကို စာရိုက်ပြီးပေးပို့ခြင်းဖြင့်လည်း စာရင်းသွင်းနိုင်ပါသည်။၂. Online Video တွေ့ဆုံမှုကို စီစဉ်ခြင်း(က) online တွေ့ဆုံမှုအတွက် Microsoft Team Application ကို အသုံးပြုမည်ဖြစ်၍ ၎င်း app ကို မိမိတို့၏ ဖုန်းများတွင် ကြိုတင် download လုပ်ထားရန် လိုပါမည်။ Link: https://products.office.com/en…/microsoft-teams/download-app Messager ဖြင့်ဆက်သွယ်လာသူများကို ဆေးခန်းမှစာရင်း လက်ခံထားကြောင်း link ပြန်ပို့ပေးပါမည်။ (ခ) ဆရာ၀န်လူနာတွေ့ဆုံခြင်းသည် online မှဖြစ်၍ မိမိဖုန်း၏ internet (data) ကိုဖွင့်ထားရန် လိုအပ်ပါသည်။ Wi-Fi အသုံးပြုမည့်သူများကလည်း Wi-Fi နှင့်ချိတ်ဆက်ထားခြင်းကို အဆင်သင့် လုပ်ထားရန် လိုပါသည်။ (ဂ) ကလေးလူနာများ ပြသရာတွင် အရေးကြီးသော ( ကိုယ်အလေးချိန်၊ ကိုယ်အပူချိန်၊ အသက်ရှူနှုန်းတို့ကို တိုင်းတာထားခြင်း၊ လူကြီးလူနာများအတွက် သွေးပေါင်ချိန်တိုင်းကိရိယာရှိပါက အဆင်သင့် တိုင်းထားခြင်း၊ နောက်ဆုံးပြသဖူးသော ဆေးမှတ်တမ်းများ၊ ဆေးလက်ကျန်များ၊ ဆေးဗူးအခွံများကို ပြနိုင်ရန် ပြင်ဆင်ထားခြင်းတို့ကို လုပ်ဆောင်ထားနိုင်လျှင် ပိုကောင်းပါသည်။ (ဃ) လူနာကို လက်ခံတွေ့ဆုံရန် ဆရာ၀န် အဆင်သင့် ဖြစ််မည့်အချိန်ကို ဖုန်းဖြင့်လည်းကောင်း၊ message ဖြင့်လည်းကောင်း လူနာကို အ‌ကြောင်းပြန်ကြားပေးပါမည်။ (င) လက်ခံတွေ့ဆုံရန် လူနာ၊ ဆရာ၀န် နှစ်ဖက်စလုံးအဆင်သင့်ဖြစ်ပါက ဆက်သွယ်ရန် link ကို message ဖြင့် အကြောင်းပြန်ကြားပေးပါမည်။ ၎င်း link ကိုနှိပ်ပြီး ဆရာ၀န်နှင့် ဆွေးနွေးနိုင်ပါမည်။  ၃. တွေ့ဆုံဆွေးနွေးခြင်း (က) ဆရာ၀န်နှင့် လူနာနှစ်ဦးနှစ်ဖက် တွေ့ဆုံမှု ဖြစ်သည့်အတွက် မိမိတို့ဆေးခန်းမှ ၎င်းတွေ့ဆုံမှုကို ၀င်ရောက်ကြည့်ရှု့ခြင်း၊ နားထောင်ခြင်း၊ video/ voice များမှတ်သားထားခြင်းတို့ကို ပြုလုပ်မထားပါ။ (ခ) လူနာနှင့် တွေ့ဆုံပြောဆိုမှုများမှ လိုအပ်သော အချက်အလက်များကို ဆရာ၀န်ကရေးမှတ်ထားပြီး ၎င်းအချက်အလက်နှင့် ဆေးကုသမှု ညွှန်ကြားချက်များကို ဆေးခန်းသို့ တိုက်ရိုက်ပေးပို့ထားမည် ဖြစ်ပါသည်။ ၎င်းစာရွက် copy ကို လူနာက ဆေးလာရောက်ယူချိန်တွင် ဆေးနှင့်အတူ ထုတ်ပေးမည် ဖြစ်ပါသည်။ ၄. ဆေးထုတ်ယူခြင်း မိမိတို့ဆေးခန်းမှ ဆရာ၀န်ညွန်ကြားထားသောဆေးကို အမျိုးအစား မှန်ကန်စွာ ရရှိနိုင်ရန် တာ၀န်ယူပါမည်။ ဆေးလာရောက်ထုတ်ယူချိန်တွင် လူနာအမည်၊ အသက်၊ ဖုန်းနံပါတ်တို့ကို ပြောဆို၍ ဆေးကိုလက်ခံပေးပါရန် မေတ္တာရပ်ခံပါသည်။ ဆေးခန်းကို လူနာခေါ်‌ဆောင်လာရန် မလိုပါ။ ကြိုတင်သဘောတူညီခြင်း online ဖြင့် ဆွေးနွေးကုသခြင်းဖြစ်၍ လူလူချင်းတွေ့ဆုံစမ်းသပ်ကုသမှုမျိုးကဲ့သို့ ပြည့်စုံသောကုသခြင်း‌‌မျိုး မဖြစ်နိုင်သည်ကို နားလည်ပေးစေလိုပါသည်။' },
        ],
      }
    },
    methods: {

      iconChange (status) {
        if (status === 'completed') return 'mdi-plus-box'
        else if (status === 'upcomming') return 'mdi-plus'
        else return 'mdi-ambulance'
      },
      getColor (status) {
        if (status === 'completed') return 'green'
        else if (status === 'upcomming') return 'orange'
        else return 'red'
      },
    },
  }
</script>

<style>

</style>
